class newsHeader {
  newsHeader({this.title, this.category, this.imageUrl, this.id, this.desc1,this.desc2,this.desc3});

  final String desc1,desc2,desc3;
  final String id;
  final String title;
  final String category;
  final String imageUrl;
}

final sampleItems = <newsHeader>[
  new newsHeader(
      title: '比特币会不会涨到20万一枚',
      category: '以比特',
      imageUrl: 'assets/image/News_Image/BlockStream.jpg',
      desc1: "比特币是由神秘的密码学专家中本聪在2008年提出论文，并且在2009年诞生首个创世纪区块，每个区块都有矿工打包存储交易信息，作为奖励完成打包存储交易的矿工会获得50个比特币的奖励，在设计之初，比特币的区块奖励逐渐减少，每21万个区块奖励减半，从比特币诞生之初到著名的披萨事件，再到后来的正规化的交易所，以及最近的17年比特币登上2万美金大关，这一神秘的完全去中心化的区块链应用一直是热度不减，而且多次被模仿被抄袭，也经历了多次的分叉、减半，比特币的热度始终不减！尤其是今年比特币也是引领了所有主流币的涨幅，直接从3000多美金爬升到1万美金大关，而人们对明年比特币减半更是充满了期待，历史上比特币每次减半都伴随着一波行情的大涨，那现在我们适合购入比特币吗？比特币多少钱的价格买进合适呢？比特币会不会涨到20万一枚呢？",
      desc2: "比特币是全球公认的价值货币，是公认的完全去中心化的真正的数字货币，是全球很多金融机构推荐的避险货币，当然我也是坚定的价值信仰者，但是针对目前市场上种种的言论和数据分析推断我都不是很感兴趣，我始终觉得盲目的信仰是没有价值的，除非我们都足够富有，我们认可比特币的价值不是为了赋予他或者论证他的价值，而是我们想从中获利，既然我们的目的只是想从中赚钱这么简单，那就要尊重市场，谁能做到低买高卖，谁就是赢家；但是市场的变幻是无情的，是不会按照我们的意愿去执行的，在今天我们永远都是在猜明天的行情，谁也不是预言家，我觉得我们只有通过完美的策略和仓位配置，来应对市场的变化，做到在本金不被套牢的情况下最大限度的去获利去收益！其实对行情的数据分析也只是一种策略，也只是为了辅助我们来做单收益，在金融市场没有最完美的策略，如果纯粹靠策略是不会安稳盈利的，多种交易策略结合行情分析的策略加上仓位配置的策略才能更好的对抗市场，如果再有24H的行情监测和算法修正就是相对的完美了；因此我还是推荐我们公司的产品~鼎昂量化机器人，我建议大家减少人为操作，只是持币，然后交给机器人收益，这样我们既不会错过中间的行情，也不会错过减半带来的收益！所以我认为比特币肯定会涨到20万一个，但是这样的论调又能怎么样呢？什么时候达到？达不到怎么办？所以没有代价的推断是最不负责任的，只有明确我们的目的就是一个为了赚钱，那就做好低买高卖就行了，其他的都是茶余饭后的谈资罢了。虽然我们不去盲目找指标查数据去争论比特币能否在减半以后达到20万一个，但是我们还是期待币圈因为比特币的带动能更加繁荣，更加成熟，成为全球化的金融市场，服务全球的用户！",
      desc3: "",
      id: '1'),
  new newsHeader(
      title: '为什么2021年大概率迎来币圈春天和牛市',
      category: '以比特',
      imageUrl: 'assets/image/News_Image/Ziliqa.jpg',
      desc1: "欧美疫情仍在深化发展中，美国在限制对检疫控制数量的基础上，仍然每天有2~3万人确证，日死亡数量在1500人左右浮动，欧洲也好不到哪去。而欧美经济已经承压不住，5月开始逐步复工。因此，欧美被动的群体免疫已经无可避免，全球也只有祈祷新冠病毒在这种广泛传播的情况下不会变异得更厉害，否则将是彻头彻尾的人类悲剧。",
      desc2: "两个关键时间点，可以作为衡量以欧美为主全球经济变化的关键变量。第一是群体免疫达到60%~70%的生效时间，多数科学家估计在8~9月份。但这个60%~70%的有效数据基本是根据兽群的经验的。吐槽一句，所谓“群体免疫”英文的原义就是“兽群免疫（herd immunity）”，不知道最早哪个小编翻译的时候还帮着欧美美化成“群体免疫”，倒是提醒了欧美最近都用“community immunity”的写法了，其实最早本来就是视人如兽的社会达尔文主义。第二是疫苗完成研发可以大规模上市的时点。目前看来2020年内没戏。即使是“特不靠谱”现在也只吹嘘说在2020年底。综合各方面的信息线索，疫苗时间至少要指向2021年年中。所以根据上述最新态势，经济危机将会如何发展呢？显然，5月欧美复工不可能产生V型反转，复工后至少半年内消费、投资和出口这创造GDP的三架马车全面被疫情在一定程度上压制，只能是“有限的复苏”。经济更可能的走向，是W型衰退。W型衰退是指经济开始复苏后不断发生反复情形，其经济走势正如“W”或者多个“W”联结的上下反复走势。5月复工，欧美经济自然有一定复苏，但由于消费、投资和出口均处于低潮，复苏到一定阶段，很容易发生各种产业、各种经济负面冲击。例如页岩油和石油行业，在欧美经济中均占有重要比例。可以预见复工后石油消费仍将处于低潮，那么再撑几个月后，多半有一大批此类企业难以继续经营，企业关张可能导致部分债务危机，其他旅游、娱乐、航空、海运等一大批产业领域的企业，均处于此种困境。而大量企业不景气、失业率难以很大幅度下降的困难局面下，易于形成不断暴雷、消费和投资低迷的经济危机深化发展局面。这种情况反映到金融市场上，就容易发生台阶式下跌的局面，1929年大萧条危机在几年中暴跌了6个台阶，指数最低时几乎只剩下最高时的10%，是最典型的例证。当然在无限量QE的美元资金支持下，当代条件不太会发生指数如此巨幅下降的情况。但资金面再泛滥，不能解决一个根本的问题。那就是企业的效益下降和出现危机，没人消费企业就没有价值。5月复工，对于欧美总体处于反弹中的股市有可能是“利好出尽是利空”。除了一季度业绩暴雷外，更重要的是复工后，各行业、各企业最新的消费和业务数据，将直接传递并影响资本市场。当资本发现各行业各企业业绩走下坡路的时候，资本市场会发生什么呢？资金面充裕就能无视真实的业绩情况吗？另一个不利因素，是美国铁了心要与中国脱钩。特朗普最近的讲话，第二次贸易战的阴影再次呈现。这不仅是对疫情甩锅，也是美国战略所在。美国疫情减缓后，中美贸易恢复也将受限甚至每况愈下。现在不仅是贸易和企业投资脱钩，科技、文化等方面的脱钩态势也非常明显。举一个例子，斯坦福大学最新今年EA轮次录取的707位新生中，没有一位来自中国内地的高中生，原因是根本没有在中国大陆面试。而美国科技机构正逐个审查，驱逐中国的“博后及访问学者”。中美脱钩已经不只是让人担心的未来，而是正在发生的现实。基本上，读者们原来有孩子留学“五眼联盟”打算的，如果是理工科，现在就可以改计划了。与中国脱钩的关税战等自然将使美国经济更恶化，但反正新冠疫情已经搞得一地鸡毛，将脱钩损失混淆在疫情损失中，反而容易让其国民接受。所以我们未来看到脱钩加速进行，应该是正常的。",
      desc3: "回到经济，在万马齐喑中，我们可以发现，数字经济可能不但是最大的亮点，而且是除了医疗以外唯二的亮点。不仅仅是中国新基建明显地推动数字社会和数字经济的建设发展。即使在欧美，疫情打压传统行业的背景下，数字经济同样将成为主要的突破口，原因自然是数字经济天生的“社交隔离”，不受新冠疫情影响。欧美原来移动互联网发展滞后，本身存在一定的发展空间，资本恐怕会推动这个领域的发展，因为市场不仅存在，而且因为疫情而强化。所以预计随着欧美5月复工，下半年欧美，尤其是美国，在数字经济的各科技领域，投资应该会大大加强。下半年开始我们应该可以看到，区块链、大数据、移动互联等领域，欧美的创业项目和项目风投会不断出现。对于区块链币圈来说，可能2021年我们会看到美国的多个新币种发行。更何况，我们也知道，2020年美国加密币合规法律体系将基本完成，而美国传统金融机构布局加密币市场的准备，也会更完善和深入。再加上宽松的资金面，所以总体认为，2021年后，重币的美国的一系列发展，可能带来加密币市场真正的一轮春天。当然，欧美发展数字科技，虽然在部分领域科技领先，但有一个最脆弱的地方，就是基础设施其实并不强。不要说目前5G发展态势可能落后，在4G移动互联的普及方面，也都不够。例如美国，1/6的工作人口没有智能手机，智能手机普及率和中国差不多，但从人口规模比较就知道市场空间较小。而且美国基站普及率是点状集中，因此未来美国数字科技应该会集中到几个大城市，但全国性普及的速度和力量，恐怕有限。",
      id: '2',
  ),
  new newsHeader(
      title: '比特币挖矿是什么意思',
      category: '以比特',
      imageUrl: 'assets/image/News_Image/CryptoBroker.jpg',
      id: '3',     
      desc1: "比特币挖矿是一种获得比特币的方式，简单来讲就是全网矿工一起来做一道题目，谁先做出来，谁就会得到比特币奖励，“矿工”需要在区块努力工作，就是消耗计算资源来处理交易，挖矿对于设备的配置要求相当高，提高设备配置，可以加强运算能力，也能更快的获得。",
      desc2: "比特币是一种电子货币，由开源的P2P软件产生，可以用来交易，也可以通过交易来获利，比特币挖矿运用的是哈希算法，在比特币系统里面，需要进行大量哈希运算，计算的值需要符合规定，谁运算的快，谁能挖到的比特币就越多。",
      desc3: "",
  ),
  new newsHeader(
      title: '以太坊是什么',
      category: '以比特',
      imageUrl: 'assets/image/article1.jpg',
      id: '4',      
      desc1: "比特币开创了去中心化密码货币的先河，五年多的时间充分检验了区块链技术的可行性和安全性。比特币的区块链事实上是一套分布式的数据库，如果再在其中加进一个符号——比特币，并规定一套协议使得这个符号可以在数据库上安全地转移，并且无需信任第三方，这些特征的组合完美地构造了一个货币传输体系——比特币网络。",
      desc2: "以太坊是一个平台，它上面提供各种模块让用户来搭建应用，如果将搭建应用比作造房子，那么以太坊就提供了墙面、屋顶、地板等模块，用户只需像搭积木一样把房子搭起来，因此在以太坊上建立应用的成本和速度都大大改善。具体来说，以太坊通过一套图灵完备的脚本语言（Ethereum Virtual Machinecode，简称EVM语言）来建立应用，它类似于汇编语言。我们知道，直接用汇编语言编程是非常痛苦的，但以太坊里的编程并不需要直接使用EVM语言，而是类似C语言、Python、Lisp等高级语言，再通过编译器转成EVM语言。",
      desc3: "市场人士指出，以太坊平台上的众筹项目还存在诸多风险，首先以太币不是去中心数字货币，存在巨庄而且持有80%以上的币值，一直未动，相当于每一个币民头顶都悬着一把利刃；其次以太坊的众筹货币分4-5轮进行解禁，需要变现，所以众筹的项目越多，解禁的压力越大；第三众筹基金的融资效应，每一次众筹都需要十倍百倍的以太坊数字货币等待融资，而不是参与交易，众筹结束后这部分货币重新进入市场进行打压；第四众筹基金的参与获利，众筹基金的目的便是获利，融到以太币不是积极参与众筹而是抛售，然后等待币值下降的时候购入再返还给用户，这便是标准的“做空获利”；第五以太坊所有的众筹项目都没有确立以太坊的货币地位，而是以积分、交易税费的形式进行抵扣，也就相当于淘宝币、天猫积分一样的性质，可抵用但是永远无法取代货币的功用。",
  ),
];
